controllers/ArchivoJuntaController.php

SELECT * FROM `archivo_junta` WHERE `junta_id`='2'
---
    public function actionIndex($id_junta)
    {
        //$this->layout = "layoutJunta";
        $archivos = ArchivoJunta::find()->where(['junta_id' => $id_junta])->all();

SELECT * FROM `archivo_junta` WHERE `id`='2'
---
    protected function findModel($id)
    {
        if (($model = ArchivoJunta::findOne($id)) !== null) {