controllers/CalibreController.php

    public function actionIndex()
    {
        $calibres = Calibre::find()->all();
---
SELECT * FROM `calibre`