controllers/CcostoController.php

    public function actionIndex()
    {
        $centros = Ccosto::find()->asArray()->all();

        $clientes_activos = Cliente::find()->where(['estado' => 'A'])->all();
---
SELECT * FROM `ccosto`
SELECT * FROM `cliente` WHERE `estado`='A'