controllers/EstadoController.php

    public function actionIndex()
    {
       $estados = Estado::find()->asArray()->all();
---
SELECT * FROM `estado`

    public function actionCreate()
    {
        $model = new Estado();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {
---
INSERT INTO `estado` (`nombre`, `orden`, `tipo`) VALUES ('Sin registros', 4, 'R')