controllers/JuntaController.php

SELECT * FROM `junta`
---
    public function actionIndex()
    {
        $juntas = Junta::find()->all();

SELECT * FROM `junta` WHERE `id`='2'
---
    protected function findModel($id)
    {
        if (($model = Junta::findOne($id)) !== null) {