controllers/NovedadController.php

    public function actionIndex()
    {

        $novedades = Novedad::find()->asArray()->all();
---
SELECT * FROM `novedad`

    public function actionCreate()
    {
        $model = new Novedad();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {
---
INSERT INTO `novedad` (`nombre`, `tipo`, `tecnica`) VALUES ('Robo', 'R', 'N')

    protected function findModel($id)
    {
        if (($model = Novedad::findOne($id)) !== null) {
---
SELECT * FROM `novedad` WHERE `id`='43'