controllers/PermisoArmaController.php

    public function actionIndex()
    {
        $permisos =  PermisoArma::find()->all();
---
SELECT * FROM `permiso_arma`