controllers/TipoArmaController.php

    public function actionIndex()
    {
        $tipos =  TipoArma::find()->all();
---
SELECT * FROM `tipo_arma`